---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.CannotSplitVerticallyCompoundWall
source: html/348f373e-5c19-067a-a5ac-6ebd817ff505.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.CannotSplitVerticallyCompoundWall Property

Can't divide Wall's face to assign different materials to a vertically compound Wall.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotSplitVerticallyCompoundWall { get; }
```